cli/find.html
<!DOCTYPE html>
<html>
<head>
<title>Find</title>
<!-- 2018-02-08 Thu 00:07 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Find</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本用法</a>
<ul>
<li><a href="#sec-1-1">1.1. 根据时间查询</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 最近 10 分钟内修改过的文件</a></li>
<li><a href="#sec-1-1-2">1.1.2. 最近 1 小时内修改过的文件</a></li>
<li><a href="#sec-1-1-3">1.1.3. 最近 1 分钟内访问过的文件</a></li>
<li><a href="#sec-1-1-4">1.1.4. 最近 1 分钟内创建的文件</a></li>
<li><a href="#sec-1-1-5">1.1.5. 某个时间点之后的文件</a></li>
<li><a href="#sec-1-1-6">1.1.6. 与另一个文件时间作比较</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 根据大小查询</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 按字节</a></li>
<li><a href="#sec-1-2-2">1.2.2. 按块(512 bytes)</a></li>
<li><a href="#sec-1-2-3">1.2.3. 按 k</a></li>
<li><a href="#sec-1-2-4">1.2.4. 按空文件</a></li>
<li><a href="#sec-1-2-5">1.2.5. 按空文件或目录</a></li>
<li><a href="#sec-1-2-6">1.2.6. 删除空目录</a></li>
<li><a href="#sec-1-2-7">1.2.7. 找出 5 个最大的文件</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. 指定多个目录查询</a></li>
<li><a href="#sec-1-4">1.4. 忽略路径</a></li>
<li><a href="#sec-1-5">1.5. 对搜索到的文件执行操作</a></li>
<li><a href="#sec-1-6">1.6. 指定 inode</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 注意事项</a>
<ul>
<li><a href="#sec-2-1">2.1. 使用 <code>-o</code> 选项时建议明确指明 <code>-print</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-08 00:07:07</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本用法</a>
<ul>
<li><a href="#sec-1-1">1.1. 根据时间查询</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 最近 10 分钟内修改过的文件</a></li>
<li><a href="#sec-1-1-2">1.1.2. 最近 1 小时内修改过的文件</a></li>
<li><a href="#sec-1-1-3">1.1.3. 最近 1 分钟内访问过的文件</a></li>
<li><a href="#sec-1-1-4">1.1.4. 最近 1 分钟内创建的文件</a></li>
<li><a href="#sec-1-1-5">1.1.5. 某个时间点之后的文件</a></li>
<li><a href="#sec-1-1-6">1.1.6. 与另一个文件时间作比较</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 根据大小查询</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 按字节</a></li>
<li><a href="#sec-1-2-2">1.2.2. 按块(512 bytes)</a></li>
<li><a href="#sec-1-2-3">1.2.3. 按 k</a></li>
<li><a href="#sec-1-2-4">1.2.4. 按空文件</a></li>
<li><a href="#sec-1-2-5">1.2.5. 按空文件或目录</a></li>
<li><a href="#sec-1-2-6">1.2.6. 删除空目录</a></li>
<li><a href="#sec-1-2-7">1.2.7. 找出 5 个最大的文件</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. 指定多个目录查询</a></li>
<li><a href="#sec-1-4">1.4. 忽略路径</a></li>
<li><a href="#sec-1-5">1.5. 对搜索到的文件执行操作</a></li>
<li><a href="#sec-1-6">1.6. 指定 inode</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 注意事项</a>
<ul>
<li><a href="#sec-2-1">2.1. 使用 <code>-o</code> 选项时建议明确指明 <code>-print</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本用法</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 根据时间查询</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 最近 10 分钟内修改过的文件</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-sh">find . -mmin -10
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 最近 1 小时内修改过的文件</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-sh">find / -mtime -1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 最近 1 分钟内访问过的文件</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-sh">find . -amin -1
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> 最近 1 分钟内创建的文件</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">

<pre class="src src-sh">find . -cmin -1
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> 某个时间点之后的文件</h4>
<div class="outline-text-4" id="text-1-1-5">
<div class="org-src-container">

<pre class="src src-sh">touch -t 05042140 stampfile
find . -newer stampfile
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> 与另一个文件时间作比较</h4>
<div class="outline-text-4" id="text-1-1-6">
<ul class="org-ul">
<li>modify 时间比较

<div class="org-src-container">

<pre class="src src-sh">find . -newer file1.txt -not -newer file2.txt
</pre>
</div>
</li>

<li>access 时间比较

<div class="org-src-container">

<pre class="src src-sh">find . -anewer file1.txt -not -anewer file2.txt
</pre>
</div>
</li>

<li>create 时间比较

<div class="org-src-container">

<pre class="src src-sh">find . -cnewer file1.txt -not -cnewer file2.txt
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 根据大小查询</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 按字节</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-sh">find . -size  1024c             # = 1024 bytes
find . -size +1024c             # &gt; 1024 bytes
find . -size -1024c             # &lt; 1024 bytes
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 按块(512 bytes)</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-sh">find . -size  2                  # = 1024 bytes
find . -size +2                  # &gt; 1024 bytes
find . -size -2                  # &lt; 1024 bytes
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 按 k</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">

<pre class="src src-sh">find . -size  1k                # = 1024 bypts
find . -size +1k                # &gt; 1024 bypts
find . -size -1k                # &lt; 1024 bypts
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> 按空文件</h4>
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">

<pre class="src src-sh">find . -size 0
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> 按空文件或目录</h4>
<div class="outline-text-4" id="text-1-2-5">
<div class="org-src-container">

<pre class="src src-sh">find . -empty
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> 删除空目录</h4>
<div class="outline-text-4" id="text-1-2-6">
<div class="org-src-container">

<pre class="src src-sh">find . -type d -empty -delete
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-7" class="outline-4">
<h4 id="sec-1-2-7"><span class="section-number-4">1.2.7</span> 找出 5 个最大的文件</h4>
<div class="outline-text-4" id="text-1-2-7">
<div class="org-src-container">

<pre class="src src-sh">find . -type f -exec ls -s {} \; | sort -n -r | head -5
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 指定多个目录查询</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sh">find /usr /home /tmp -name \*.jar
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 忽略路径</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
-prune   If the file is a directory, do not descend into it. Return true.
         If -depth is given, no effect. Return false.
         Because -delete implies -depth, you cannot usefully use -prune and -delete together.
</pre>

<div class="org-src-container">

<pre class="src src-sh">find . \( -path "./path1" -o -path "./path2" \) -prune -o -name "filename" -print
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 对搜索到的文件执行操作</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh">find -iname "myprogram.c" -exec md5sum {} \;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 指定 inode</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-sh">find -inum 888888 -delete
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 注意事项</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 使用 <code>-o</code> 选项时建议明确指明 <code>-print</code></h3>
<div class="outline-text-3" id="text-2-1">
<p>
If the given expression to find does not contain any of the 'action' primaries ‑exec, ‑ok, or ‑print, then the given expression is effectively replaced by:
</p>

<p>
<code>find \( expression \) -print</code>
</p>

<p>
The implied parenthesis can cause unexpected results.
</p>

<p>
For example, consider these two similar commands:
</p>

<div class="org-src-container">

<pre class="src src-bash">$ find -name tmp -prune -o -name \*.txt
./bin/data/secret.txt
./tmp
./missingEOL.txt
./public_html/graphics/README.txt
./datafile.txt

$ find -name tmp -prune -o -name \*.txt -print
./bin/data/secret.txt
./missingEOL.txt
./public_html/graphics/README.txt
./datafile.txt
</pre>
</div>

<p>
The lack of an action in the first command means it is equivalent to:
</p>

<p>
<code>find . \( -name tmp -prune -o -name \*.txt \) -print</code>
</p>

<p>
This causes tmp to be included in the output.
</p>

<p>
However for the second find command <b>the normal rules of Boolean operator precedence apply</b>, so the pruned directory does not appear in the output.
</p>
</div>
</div>
</div>
</div>
</body>
</html>